Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
ser = pd.Series([4, 8, 15, 16, 23, 42])

In [4]:
print(ser,type(ser))

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64 <class 'pandas.core.series.Series'>

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
var = [1,2,3,4,56,7,8,9,10]
pd.Series(var)

0     1
1     2
2     3
3     4
4    56
5     7
6     8
7     9
8    10
dtype: int64

|Q3. Create a Pandas DataFrame that contains the following data:

In [7]:
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
           'Gender':['Female','Male','Female']}

df = pd.DataFrame(data)

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans : dataframe is a structure way to represent the data but series is like list it doesn't give you the propper structure of a data it simple give you index and data,series is a one dimensional representation but dataframe is two dimensional representation

In [8]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [10]:
dataf = pd.Series(data)

In [11]:
dataf

Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans : some common fucntion i use to manipulate data in pandas datagrame head(),tail(),df.loc[],df.iloc[],df.unique,df.describe(),df.dtype()

In [12]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans : Series lenth is not mutable but we can change the data ,dataframe is mutable we can change data at any point of time and panel also mutable we can change data and lenth both

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
# Create Series by assigning names
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis=1)
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000